# RailingCurvesNotSplitRamp Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailingCurvesNotSplitRamp Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The slope of this railing will not parallel the ramp at landings. To get a parallel railing, split the railing sketch at the ends of landings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailingCurvesNotSplitRamp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingCurvesNotSplitRamp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailingCurvesNotSplitRamp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace